# 그래프 : 실제 세계의 현상, 사물을 정점(Vertex) 또는 노드(Node)와 간선(Edge)로 표현하기 위해 사용
# 정점의 차수 : 무방향 그래프에서 하나의 정점에 인접한 정점의 수
# 진입 차수 : 방향 그래프에서 외부에서 오는 간선의 수
# 진출 차수 : 방향 그래프에서 외부로 향하는 간선의 수
# 경로 길이 : 경로를 구성하기 위해 사용된 간선의 수
# 단순 경로 : 처음 정점과 끝 정점을 제외하고 중복된 정점이 없는 경로
# 사이클 : 단술 경로의 시작 정점과 종료 정점이 동일할 때 (사이클이 없으면 비순환 그래프)

# 무방향 그래프 : 방향이 없는 그래프(간선을 통해, 노드는 양 방향으로 갈 수 있음)
# 방향 그래프 : 간선에 방향이 있는 그래프
# 가중치 그래프 : 간선에 비용/가중치가 할당된 그래프
# 연결 그래프 : 무방향 그래프에 있는 모든 노드에 대해 항상 경로가 존재하는 경우
# 비연결 그래프 : 무방향 그래프에서 특정 노드에 대한 경로가 없는 경우
# 완전 그래프 : 그래프의 모든 노드가 서로 연결되어 있는 그래프

